* Only Alpha-Numeric Values
* Right Outer Join
* Multiple Column to Tuple
* Value Assign based on Condition on Another Column

# **Only Alpha-Numeric Values**

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(data={'TITLE': ['fox!@', 'Kangaroo12###', 'deer',
                                   'spider', 'fox'],
                        'ABSTRACT': ['fox', 'Kangaroo$%%', 'deer',
                                   'spider', 'fox']})
df

           TITLE     ABSTRACT
0          fox!@          fox
1  Kangaroo12###  Kangaroo$%%
2           deer         deer
3         spider       spider
4            fox          fox

In [3]:
df['TITLE'] = df.TITLE.str.replace('[^a-zA-Z]', '')
df['ABSTRACT'] = df.ABSTRACT.str.replace('[^a-zA-Z]', '')
df

      TITLE  ABSTRACT
0       fox       fox
1  Kangaroo  Kangaroo
2      deer      deer
3    spider    spider
4       fox       fox

# **Right Outer Join**

In [10]:
df1 = pd.DataFrame([["John Doe","14-3-1999","12"],
                ["Jane Doe","15-6-1995","3"]], columns=["Player","Birthday","2010"])
#print(df1)
df2 = pd.DataFrame([["John Doe", "2"],["Jane Doe", "1"], ["Alice", "3"]], columns=["Player","2011"])

#print(df2)

df3 = pd.merge(df1, df2, how="right", on="Player")
print(df3)

     Player   Birthday 2010 2011
0  John Doe  14-3-1999   12    2
1  Jane Doe  15-6-1995    3    1
2     Alice        NaN  NaN    3

# **Multiple Column to Tuple**

In [24]:
df = pd.DataFrame({'id': [1,2,3,3,3], 'v1': ['a', 'a', 'c', 'c', 'd'], 'v2': ['z', 'y', 'w', 'y', 'z']})
df

   id v1 v2
0   1  a  z
1   2  a  y
2   3  c  w
3   3  c  y
4   3  d  z

In [30]:
df['New'] = [tuple(x) for x in df[['v1','v2']].to_records(index=False)]

In [31]:
df=df[['id','New']]

In [33]:
df=df.set_index('id')
df.to_dict()

{'New': {1: ('a', 'z'), 2: ('a', 'y'), 3: ('d', 'z')}}

# **Value Assign based on Condition on Another Column**

In [49]:
data = {'Category': [86,23,32,13,45,12]}
df = pd.DataFrame (data, columns = ['Category'], index=['I1', 'I2','I3','I4','I5','I6'])
df

    Category
I1        86
I2        23
I3        32
I4        13
I5        45
I6        12

In [50]:
df = df.reset_index()
df['Class'] = 'Other'
for i,e in enumerate(df['Average_Sales']):
  if e < 30:
    df.at[i,'Category'] = 'low'

df

  index  Category  Class
0    I1        86  Other
1    I2        23    low
2    I3        32  Other
3    I4        13    low
4    I5        45  Other
5    I6        12    low